inletoutletsimulation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            patch;
        physicalType    patch;
        nFaces          500;
        startFace       354;
    }
    topWall
    {
        type            patch;
        physicalType    patch;
        nFaces          15;
        startFace       854;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          2;
        startFace       869;
    }
    lowerWall
    {
        type            patch;
        physicalType    patch;
        nFaces          15;
        startFace       871;
    }
    intlet
    {
        type            patch;
        physicalType    patch;
        nFaces          2;
        startFace       886;
    }
    internalpatch
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       888;
    }
)

// ************************************************************************* //
