inletoutletsimulation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  intlet
    {
        type         fixedValue;  
        value        uniform (2 0 0);
       
    }

  outlet
    {
       type          zeroGradient;   
       
       
    }

  topWall
    {
        type           noSlip;
    }

  lowerWall

    {
        type           noSlip;
        
    }

 internalpatch

    {
        type           noSlip;
        
    }
  frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
